In [1]:
import pandas as pd
from sqlalchemy import create_engine
from config import un, pw, uri, port
import pymysql
pymysql.install_as_MySQLdb()

### Store CSV into DataFrame

In [8]:
csv_file = "../Resources/BaseStats.csv"
basestat_df = pd.read_csv(csv_file)
basestat_df.head()

   Pokemonid        Name    HP   ATT   DEF    SPA    SPD   SPE  TOTAL   AVG
0        1.0   Bulbasaur  45.0  49.0  49.0   65.0   65.0  45.0  318.0  53.0
1        2.0     Ivysaur  60.0  62.0  63.0   80.0   80.0  60.0  405.0  67.5
2        3.0    Venusaur  80.0  82.0  83.0  100.0  100.0  80.0  525.0  87.5
3        4.0  Charmander  39.0  52.0  43.0   60.0   50.0  65.0  309.0  51.5
4        5.0  Charmeleon  58.0  64.0  58.0   80.0   65.0  80.0  405.0  67.5

### Create new data with select columns

   id first_name last_name
0   1    Benetta   Cancott
1   2     Lilyan    Cherry
2   3    Ezekiel   Benasik
3   4    Kennedy     Atlay
4   5    Sanford    Salmen

### Store JSON data into a DataFrame

In [4]:
csv_file2 = "../Resources/tierinfo.csv"
tier_df = pd.read_csv(csv_file2)
tier_df.head()

   Number    Pokemon Tier
0       1      Aipom   NU
1       2      Arbok   NU
2       3    Ariados   NU
3       4  Azumarill   NU
4       5   Beedrill   NU

### Clean DataFrame

   index  customer_id                address  us_state
0      0            1  043 Mockingbird Place   Indiana
1      1            2       4 Prentice Point   Indiana
2      2            3      46 Derek Junction     Texas
3      3            4  11966 Old Shore Place  Missouri
4      4            5     5 Evergreen Circle  New York

In [6]:
new_customer_location_df.columns = ['id', 'customer_id', 'address', 'state']
new_customer_location_df.head()

   id  customer_id                address     state
0   0            1  043 Mockingbird Place   Indiana
1   1            2       4 Prentice Point   Indiana
2   2            3      46 Derek Junction     Texas
3   3            4  11966 Old Shore Place  Missouri
4   4            5     5 Evergreen Circle  New York

### Connect to local database

In [5]:
rds_connection_string = f"{un}:{pw}@{uri}:{port}/pokemon_db"
engine = create_engine(f'mysql://{rds_connection_string}')

### Check for tables

In [6]:
engine.table_names()

[]

### Use pandas to load csv converted DataFrame into database

In [10]:
basestat_df.to_sql(name='basestats', con=engine, if_exists='append', index=False)

### Use pandas to load json converted DataFrame into database

In [11]:
tier_df.to_sql(name='tiers', con=engine, if_exists='append', index=False)

### Confirm data has been added by querying the customer_name table
* NOTE: can also check using pgAdmin

In [12]:
pd.read_sql_query('select * from basestats', con=engine).head()

   Pokemonid        Name    HP   ATT   DEF    SPA    SPD   SPE  TOTAL   AVG
0        1.0   Bulbasaur  45.0  49.0  49.0   65.0   65.0  45.0  318.0  53.0
1        2.0     Ivysaur  60.0  62.0  63.0   80.0   80.0  60.0  405.0  67.5
2        3.0    Venusaur  80.0  82.0  83.0  100.0  100.0  80.0  525.0  87.5
3        4.0  Charmander  39.0  52.0  43.0   60.0   50.0  65.0  309.0  51.5
4        5.0  Charmeleon  58.0  64.0  58.0   80.0   65.0  80.0  405.0  67.5

### Confirm data has been added by querying the customer_location table

In [13]:
pd.read_sql_query('select * from tiers', con=engine).head()

   Number    Pokemon Tier
0       1      Aipom   NU
1       2      Arbok   NU
2       3    Ariados   NU
3       4  Azumarill   NU
4       5   Beedrill   NU